<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Xerox package based on the override-able parameters:  model, download type, and OS Version.

model example:  'Workcentre 6515'
download types:  The download type desired; the provided string is searched in the web page.  Some examples are:
    - "macOS Print and Scan Driver Installer" (default)
    - "ICA Scan USB Driver"
    - "IMAC CA Scan USB Driver"
    - "TWAIN Scan Driver"
OS version:  
    - 12 (default)
    - x11
    - 10_15
    - 10_14
    - 10_13
    - (older OS Versions should be supported, however the format changes; contact me for details if this is needed)

Tested both "macOS Print and Scan Driver Installer" and "ICA Scan USB Driver" to download and package successfully.
    </string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.XeroxPrintDriver</string>
    <key>Input</key>
    <dict>
        <key>MODEL</key>
        <string>Workcentre 6515</string>
        <key>DOWNLOAD_TYPE</key>
        <string>macOS Print and Scan Driver Installer</string>
        <key>OS_VERSION</key>
        <string>12</string>
        <key>NAME</key>
        <string>Xerox Print Drivers</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>XeroxPrintDriverURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>model</key>
                <string>%MODEL%</string>
                <key>download_type</key>
                <string>%DOWNLOAD_TYPE%</string>
                <key>os_version</key>
                <string>%OS_VERSION%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>Xerox %DOWNLOAD_TYPE% %MODEL%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Xerox Corporation (G59Y3XFNFR)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>purge_destination</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpackpayload</string>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
                <key>purge_destination</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpackpayload/*/*/*/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/unpackpayload</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
